#!/bin/bash

url="http://192.168.1.43:9200/pd_baike/baike"

ids=(
"4a4f61c9a4eb5b38e3f8db6c8b81893a"
"d9957fadda02afe19c05877cf3c9075c"
"e241c43a92695f5288fcf4d059075099"
"84def4396dd8dd6118adf2c2c42a8d19"
"adff4362fab349f4f7ca414811480a61"
"90b1b28b31fc14516b32bebd54f20245"
"7d31e64f3694d9a05f92cd239cd2a88e"
"dd0c63aad94beacd59236a168203995a"
"9a5d1eb62a8610c933a73ef82a797dc2"
"64ff683b98fde5551d74cc4bda746c3f"
"085ca3fb7e022903ff0a668732f33207"
"a298f6536b33e5713fc6fc039864744d"
"92568fcbdd8bed8db5dafc7531151caa"
"902e269a2f6d0c9dc8dbc608a0724006"
"fe9591098290b3aa6b60a88ffe43a2ac"
"7e9538e47d2f637b3b41768da68498a8"
"5b573262f70fa2986a3a679ff17da8d5"
"363aedb1abe61da1115af5a505f9053c"
"f1178c24c5e1ebecbba5d867b3044636"
"f742465bb6d049869b949e826ae55bdd"
"5b7afd5f11b376f350a6e3ce982c9964"
"f1167acc8292fa5dc423641839123f46"
)

titles=(
"威霆"
"戴姆"
"梅赛斯迈巴赫"
"梅赛斯amg"
"smart"
"a级" 
"b级" 
"c级" 
"e级" 
"s级" 
"cla级"
"cls级"
"gla级"
"glc级"
"gle级"
"gls级"
"g级" 
"r级" 
"sl级"
"slc级"
"amg gt"
"v级" 
)


contents=(
"高端商务车"
"戴姆勒股份公司是全球最成功的汽车企业之一。戴姆勒集团旗下业务部门包括梅赛德斯-奔驰乘用车、戴姆勒卡车、梅赛德斯-奔驰轻型商务车、戴姆勒客车和戴姆勒金融服务，是全球最大的豪华车厂商之一，也是全球最大的商用车厂商，业务遍及全球各地。"
"迈巴赫与迈巴赫发动机制造厂是一曾经在1921年到1940年间活跃于欧洲地区的德国超豪华汽车品牌与制造厂，车厂创始人卡尔·迈巴赫的父亲威廉·迈巴赫曾担任戴姆勒发动机公司（今日戴姆勒集团前身）的首席技术总监，两厂渊源甚深。1997年戴姆勒集团在东京车展中展出一辆以迈巴赫为名的概念性超豪华四门轿车，正式让这个德国汽车品牌在销声匿迹多年后再次复活。今日的迈巴赫是戴姆勒汽车集团旗下，等级最高的豪华房车专用品牌"
"AMG总部位于非凡驾驭之乡——德国阿法特巴赫。作为戴姆勒集团在高性能汽车细分市场中的技术先锋，AMG以“非凡驾驭”作为品牌承诺、始终以尖端科技与执着匠心磨砺自我：旨在打造兼具卓越品质和澎湃动力的高性能座驾，为客户带来淋漓尽致的多重感官体验。"
"Smart汽车是德国戴姆勒旗下品牌迷你车和微型车系列"
"小型三门和五门前驱掀背车系"
"小型五门前驱轿式底盘休旅车系"
"小型行政轿车系"
"中型豪华行政轿车系"
"大型豪华房车系，品牌旗舰房车"
"小型四门前驱轿跑车系"
"中大型四门轿跑车系列，有着双门跑车般流线造型"
"小型四门前驱运动型休旅车系"
"小型豪华五门休闲越野用车系"
"中型豪华五门休闲越野用车系"
"大型豪华五门七人座休闲越野用车系"
"以军用车辆民用化的三门及五门越野用车系"
"豪华运动旅行车"
"大型纯双座轻量化硬顶敞篷跑车系列"
"以C系列底盘为基础衍生的小型纯双座硬顶敞篷跑车系列"
"AMG GT是继超级跑车SLS AMG之后推出的全新纯双座跑车，不过并非SLS AMG后继车型，其尺码更为入门紧凑的豪华跑车级距"
"大型八人座多功能休旅车系列"
)

set -x
for (( i=0; i<${#ids[@]}; i++)); do
  curl -XPOST ${url}/${ids[$i]} -d '
  {
    "content": "'${contents[$i]}'",
    "pv": 1000000,
    "custom_tag": "社会",
    "title": "'${titles[$i]}'"
  }'
  echo ""
done
